In [1]:
from data import *

table=BasicTable('2330')

start get data TaiwanStockMonthRevenue
start get data TaiwanStockPrice
start get data TaiwanStockFinancialStatements
start get data TaiwanStockDividend
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockPrice
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockDividend
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockFinancialStatements
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockMonthRevenue

In [2]:
table.priceTable

,date,stock_id,Trading_Volume,Trading_money,open,max,min,close,spread,Trading_turnover
0,2015-01-05,2330,32214177,4459516134,140.5,140.5,137.5,139.5,-1.5,9377
1,2015-01-06,2330,67649997,9104346055,137.5,137.5,133.0,133.5,-6.0,26240
2,2015-01-07,2330,43886007,5887797145,133.5,135.0,133.5,134.0,0.5,14735
3,2015-01-08,2330,42551468,5839710584,136.5,138.0,136.0,138.0,4.0,12327
4,2015-01-09,2330,61920268,8308394250,135.0,135.5,133.0,134.0,-4.0,24470
...,...,...,...,...,...,...,...,...,...,...
1971,2023-02-01,2330,42539626,22450948467,532.0,533.0,522.0,530.0,8.0,31487
1972,2023-02-02,2330,46523592,25091483557,538.0,542.0,537.0,540.0,10.0,45495
1973,2023-02-03,2330,34156234,18439613447,540.0,542.0,536.0,542.0,2.0,39674
1974,2023-02-06,2330,32208918,17041821849,532.0,533.0,526.0,526.0,-16.0,46279
1975,2023-02-07,2330,24362116,12767910080,524.0,528.0,522.0,523.0,-3.0,28519

In [4]:
md=ManageData()

In [12]:
pivotTable=md.bt.getPivotTable(table.priceTable,'close')

In [14]:
monthMean=md.bt.periodMean(20,pivotTable)

In [19]:
pivotTable.rename(columns={'2330':'price'},inplace=True)

In [16]:
monthMean.rename(columns={'2330':'monthMean'},inplace=True)

In [17]:
monthMean

stock_id    monthMean
date
2015-01-05        NaN
2015-01-06        NaN
2015-01-07        NaN
2015-01-08        NaN
2015-01-09        NaN
...               ...
2023-02-01    478.725
2023-02-02    482.975
2023-02-03    487.250
2023-02-06    490.700
2023-02-07    494.300

[1976 rows x 1 columns]

In [20]:
pivotTable

stock_id    price
date
2015-01-05  139.5
2015-01-06  133.5
2015-01-07  134.0
2015-01-08  138.0
2015-01-09  134.0
...           ...
2023-02-01  530.0
2023-02-02  540.0
2023-02-03  542.0
2023-02-06  526.0
2023-02-07  523.0

[1976 rows x 1 columns]

In [21]:
pivotTable.join(monthMean)

stock_id    price  monthMean
date
2015-01-05  139.5        NaN
2015-01-06  133.5        NaN
2015-01-07  134.0        NaN
2015-01-08  138.0        NaN
2015-01-09  134.0        NaN
...           ...        ...
2023-02-01  530.0    478.725
2023-02-02  540.0    482.975
2023-02-03  542.0    487.250
2023-02-06  526.0    490.700
2023-02-07  523.0    494.300

[1976 rows x 2 columns]